---
kind: type
id: T:Autodesk.Revit.DB.Architecture.RailSupportJustification
source: html/4f72a67f-23eb-5b4c-2cc1-77731e5599ea.htm
---
# Autodesk.Revit.DB.Architecture.RailSupportJustification

The justification of the rail supports.

## Syntax (C#)
```csharp
public enum RailSupportJustification
```